AshanMadusanka/stm32f746xx-drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32f746xx.h"


void Delay() {
    for (uint32_t i = 0; i < 500000; i++) {
        // Simple delay loop
    }

}
int main(void)
{

    GPIO_Handle_t GpioBGreen;
    GPIO_Handle_t GpioBBlue;
    GPIO_Handle_t GpioBRed;




    GpioBGreen.pGPIOx = GPIOB;
    GpioBBlue.pGPIOx = GPIOB;
    GpioBRed.pGPIOx = GPIOB;
    GpioBGreen.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_0;
    GpioBBlue.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_7;
    GpioBRed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_14;
    GpioBGreen.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioBBlue.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioBRed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioBGreen.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioBBlue.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioBRed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioBGreen.GPIO_PinConfig.GPIO_PinPuPdControl =GPIO_PIN_PU; // Pull-up for green LED
    GpioBBlue.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU; // Pull-up for blue LED
    GpioBRed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU; // Pull-up for red LED
    GpioBGreen.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD; // Open-drain for green LED
    GpioBBlue.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD; // Open-drain for blue LED
    GpioBRed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD; // Open-drain for red LED

    // Enable the peripheral clock
    GPIO_PeriClockControl(GPIOB, ENABLE);


    // Initialize the pin
    GPIO_Init(&GpioBGreen);
    GPIO_Init(&GpioBBlue);
    GPIO_Init(&GpioBRed);


    while (1) {
        GPIO_ToggleOutputPin(GPIOB,GPIO_PIN_0);
        GPIO_ToggleOutputPin(GPIOB,GPIO_PIN_7);
        GPIO_ToggleOutputPin(GPIOB,GPIO_PIN_14);

        Delay();
    }

}
